# loaded Data set

In [11]:
import pandas as pd

In [ ]:
df = pd.read_csv("data_small/TG_STAID000001.txt",skiprows = 20,parse_dates=["   DATE"])

In [15]:
df

       STAID   SOUID      DATE     TG   Q_TG
0          1   35381  18600101     21      0
1          1   35381  18600102     46      0
2          1   35381  18600103     31      0
3          1   35381  18600104     37      0
4          1   35381  18600105     31      0
...      ...     ...       ...    ...    ...
59316      1   35381  20220527  -9999      9
59317      1   35381  20220528  -9999      9
59318      1   35381  20220529  -9999      9
59319      1   35381  20220530  -9999      9
59320      1   35381  20220531  -9999      9

[59321 rows x 5 columns]

# Show certain rows

In [17]:
df[10:20]

    STAID   SOUID      DATE     TG   Q_TG
10      1   35381  18600111     -5      0
11      1   35381  18600112    -18      0
12      1   35381  18600113    -27      0
13      1   35381  18600114    -26      0
14      1   35381  18600115    -37      0
15      1   35381  18600116     -9      0
16      1   35381  18600117      7      0
17      1   35381  18600118     -6      0
18      1   35381  18600119    -16      0
19      1   35381  18600120    -19      0

# Show Columns

In [ ]:
df.columns["DATE"]